In [29]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [30]:
data = pd.read_excel("C:\\Users\\djhei\\anaconda3\\Chapter7AssignmentData.xlsx",sheet_name = "Sheet1")
#print(data)
data.head()

        Name  Age ProgrammingExperience ManagementExperience    Salary
0    John A.   32                     9                    3  48008.21
1    Jane B.   41                    10                   20 293159.84
2   Jimmy C.   17                     1                    0  13603.64
3   Jamie D.   61                     1                   30 195202.95
4  Archie E.   17                   one                    0  13605.57

In [31]:
data.dtypes

Name                      object
Age                        int64
ProgrammingExperience     object
ManagementExperience      object
Salary                   float64
dtype: object

In [32]:
data.ManagementExperience.unique()
data[data.ManagementExperience == "four"]
data.ManagementExperience = data.ManagementExperience.str.replace("four", "4")
#ss
#data.ProgrammingExperience.unique()
data[data.ProgrammingExperience == "one"]
data.ProgrammingExperience = data.ProgrammingExperience.str.replace("one", "1")
data[data.ProgrammingExperience == "two"]
data.ProgrammingExperience = data.ProgrammingExperience.str.replace("two", "2")
data.astype('ProgrammingExperience':'float', 'ManagementExperience':'float')

SyntaxError: invalid syntax (<ipython-input-32-e6bac44ec74b>, line 10)